app/controllers/events_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."listed" = $1 ORDER BY "events"."id" ASC LIMIT $2 OFFSET $3  [["listed", "t"], ["LIMIT", 1000], ["OFFSET", 0]]
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "events" WHERE "events"."listed" = $1 LIMIT $2 OFFSET $3) subquery_for_count  [["listed", "t"], ["LIMIT", 10], ["OFFSET", 0]]
---
  def index
    @events = Event.listed.page(params[:page])

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_event
    Event.find(params[:id])